/****************************************************************************
// 文件名      ADC.h
//----------------------------------------------------------------------------
// 处理器:	Infineon XC2267M-104F80
//
// 编译器:	Keil 2.1
//
//
// 描述:	包含所有函数原型及ADC用到的宏定义.
****************************************************************************/

#ifndef _ADC_H_
#define _ADC_H_
#include  "XC22xxMREGS.H"
extern uword P15_Mask = 0x0005;
extern uword P5_Mask = 0x0000;
void ADC_vInit(void);
#endif  // ifndef _ADC_H_
